Tekla.Structures.ModelInternal.dotChamfer_t
Struct for the Chamfer.

Tekla.Structures.ModelInternal.dotChamfer_t.X
The X and Y values for the Chamfer

Tekla.Structures.ModelInternal.dotChamfer_t.Y
The X and Y values for the Chamfer

Tekla.Structures.ModelInternal.dotChamfer_t.Type
The Type of the Chamfer

Tekla.Structures.ModelInternal.dotChamfer_t.DZ1
The Thicknes offsets for the Chamfer.
Note, these do nothing when used with the PolyBeam.

Tekla.Structures.ModelInternal.dotChamfer_t.DZ2
The Thicknes offsets for the Chamfer.
Note, these do nothing when used with the PolyBeam.